# Project: Building-Machine-Learning-Pipeline-on-Startup-Acquisition
* 1st step: Data preprocessing

# Objective:
The objective of the project is to predict whether a startup which is currently Operating, IPO, Acquired, or closed.This problem will be solved through a Supervised Machine Learning approach by training a model based on the history of startups which were either acquired or closed.

# Summary:
The data contains industry trends, investment insights and individual company information. Since the data was acquired on a trial basis, it only contains information about companies. After training the model, we predict whether startups still operating, IPO, acquired, or closed.

In [226]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [227]:
# Read the file and see 1st 5 rows
df= pd.read_csv("companies.csv")
df.head()

,id,Unnamed: 0.1,entity_type,entity_id,parent_id,name,normalized_name,permalink,category_code,status,...,first_milestone_at,last_milestone_at,milestones,relationships,created_by,created_at,updated_at,lat,lng,ROI
0,c:1,0,Company,1,NaN,Wetpaint,wetpaint,/company/wetpaint,web,operating,...,2010-09-05,2013-09-18,5.0,17.0,initial-importer,2007-05-25 06:51:27,2013-04-13 03:29:00,47.606209,-122.332071,15.5
1,c:10,1,Company,10,NaN,Flektor,flektor,/company/flektor,games_video,acquired,...,NaN,NaN,NaN,6.0,initial-importer,2007-05-31 21:11:51,2008-05-23 23:23:14,34.021122,-118.396467,NaN
2,c:100,2,Company,100,NaN,There,there,/company/there,games_video,acquired,...,2003-02-01,2011-09-23,4.0,12.0,initial-importer,2007-08-06 23:52:45,2013-11-04 02:09:48,37.562992,-122.325525,NaN
3,c:10000,3,Company,10000,NaN,MYWEBBO,mywebbo,/company/mywebbo,network_hosting,operating,...,NaN,NaN,NaN,NaN,NaN,2008-08-24 16:51:57,2008-09-06 14:19:18,NaN,NaN,NaN
4,c:10001,4,Company,10001,NaN,THE Movie Streamer,the movie streamer,/company/the-movie-streamer,games_video,operating,...,NaN,NaN,NaN,NaN,NaN,2008-08-24 17:10:34,2008-09-06 14:19:18,NaN,NaN,NaN

In [228]:
#last 5 rows
df.tail()

,id,Unnamed: 0.1,entity_type,entity_id,parent_id,name,normalized_name,permalink,category_code,status,...,first_milestone_at,last_milestone_at,milestones,relationships,created_by,created_at,updated_at,lat,lng,ROI
196548,c:99940,196548,Company,99940,NaN,Webgility,webgility,/company/webgility,ecommerce,operating,...,2013-08-12,2013-08-12,2.0,5.0,NaN,2011-09-06 23:17:56,2013-08-13 00:39:13,37.774929,-122.419415,NaN
196549,c:9995,196549,Company,9995,NaN,FohBoh,fohboh,/company/fohboh,public_relations,operating,...,2013-05-01,2013-05-01,1.0,14.0,NaN,2008-08-24 15:46:26,2013-06-28 20:55:30,37.338208,-121.886329,NaN
196550,c:9996,196550,Company,9996,NaN,CSC,csc,/company/csc,consulting,operating,...,2012-01-01,2013-10-30,3.0,44.0,NaN,2008-08-24 15:46:58,2013-06-28 20:52:01,38.882334,-77.171091,NaN
196551,c:9997,196551,Company,9997,NaN,Top-candidate,top candidate,/company/top-candidate,search,operating,...,NaN,NaN,NaN,1.0,NaN,2008-08-24 16:00:22,2013-06-28 20:56:44,34.052234,-118.243685,NaN
196552,c:9998,196552,Company,9998,NaN,Closet Couture,closet couture,/company/closet-couture,ecommerce,operating,...,2006-07-01,2008-09-10,2.0,1.0,NaN,2008-08-24 16:46:13,2013-03-23 12:01:50,34.035633,-118.515590,NaN

In [229]:
# size of the dataset
df.shape

(196553, 44)

* The dataset have 196553 rows and 44 columns

In [230]:
# Brief discription of dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 196553 entries, 0 to 196552
Data columns (total 44 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   id                   196553 non-null  object
 1   Unnamed: 0.1         196553 non-null  int64
 2   entity_type          196553 non-null  object
 3   entity_id            196553 non-null  int64
 4   parent_id            0 non-null       float64
 5   name                 196531 non-null  object
 6   normalized_name      196527 non-null  object
 7   permalink            196553 non-null  object
 8   category_code        123186 non-null  object
 9   status               196553 non-null  object
 10  founded_at           91227 non-null   object
 11  closed_at            2620 non-null    object
 12  domain               126545 non-null  object
 13  homepage_url         126545 non-null  object
 14  twitter_username     80591 non-null   object
 15  logo_url             110110 non-null  object
 16  logo_width           110110 non-null  float64
 17  logo_height          110110 non-null  float64
 18  short_description    7131 non-null    object
 19  description          92048 non-null   object
 20  overview             126971 non-null  object
 21  tag_list             81452 non-null   object
 22  country_code         87990 non-null   object
 23  state_code           50903 non-null   object
 24  city                 83890 non-null   object
 25  region               196553 non-null  object
 26  first_investment_at  2583 non-null    object
 27  last_investment_at   2583 non-null    object
 28  investment_rounds    2591 non-null    float64
 29  invested_companies   2591 non-null    float64
 30  first_funding_at     31507 non-null   object
 31  last_funding_at      31507 non-null   object
 32  funding_rounds       31707 non-null   float64
 33  funding_total_usd    27874 non-null   float64
 34  first_milestone_at   91699 non-null   object
 35  last_milestone_at    91699 non-null   object
 36  milestones           91699 non-null   float64
 37  relationships        129667 non-null  float64
 38  created_by           155533 non-null  object
 39  created_at           196553 non-null  object
 40  updated_at           196553 non-null  object
 41  lat                  83852 non-null   float64
 42  lng                  83852 non-null   float64
 43  ROI                  726 non-null     float64
dtypes: float64(12), int64(2), object(30)
memory usage: 66.0+ MB

In [231]:
# Statistical data of numeric columns
df.describe()

,Unnamed: 0.1,entity_id,parent_id,logo_width,logo_height,investment_rounds,invested_companies,funding_rounds,funding_total_usd,milestones,relationships,lat,lng,ROI
count,196553.000000,196553.000000,0.0,110110.000000,110110.000000,2591.000000,2591.000000,31707.000000,2.787400e+04,91699.000000,129667.000000,83852.000000,83852.000000,726.000000
mean,98276.000000,153006.227333,NaN,459.132685,222.728917,2.372057,2.204940,1.659760,1.481652e+07,1.199402,2.852067,37.564512,-52.123066,45.745037
std,56740.108067,90209.250941,NaN,594.982577,333.090722,12.173510,11.436955,1.201666,6.775937e+07,0.540099,9.100309,15.477102,70.049067,572.035638
min,0.000000,1.000000,NaN,1.000000,1.000000,1.000000,1.000000,1.000000,2.910000e+02,1.000000,1.000000,-50.942326,-159.497746,0.011111
25%,49138.000000,59850.000000,NaN,192.000000,70.000000,1.000000,1.000000,1.000000,5.000000e+05,1.000000,1.000000,34.052234,-111.940005,2.648879
50%,98276.000000,174539.000000,NaN,267.000000,105.000000,1.000000,1.000000,1.000000,2.564500e+06,1.000000,1.000000,39.768403,-77.036871,6.500497
75%,147414.000000,232655.000000,NaN,484.000000,232.000000,1.000000,1.000000,2.000000,1.100000e+07,1.000000,3.000000,45.421530,-0.127758,13.549900
max,196552.000000,286215.000000,NaN,18200.000000,9600.000000,478.000000,459.000000,15.000000,5.700000e+09,9.000000,1189.000000,77.553604,176.212549,13333.333333

In [232]:
# count of null va;ues columnwise
df.isnull().sum()

id                          0
Unnamed: 0.1                0
entity_type                 0
entity_id                   0
parent_id              196553
name                       22
normalized_name            26
permalink                   0
category_code           73367
status                      0
founded_at             105326
closed_at              193933
domain                  70008
homepage_url            70008
twitter_username       115962
logo_url                86443
logo_width              86443
logo_height             86443
short_description      189422
description            104505
overview                69582
tag_list               115101
country_code           108563
state_code             145650
city                   112663
region                      0
first_investment_at    193970
last_investment_at     193970
investment_rounds      193962
invested_companies     193962
first_funding_at       165046
last_funding_at        165046
funding_rounds         164846
funding_total_usd      168679
first_milestone_at     104854
last_milestone_at      104854
milestones             104854
relationships           66886
created_by              41020
created_at                  0
updated_at                  0
lat                    112701
lng                    112701
ROI                    195827
dtype: int64

In [233]:
# null values percentage
percentage = []
for i in df:
    per= (df[i].isnull().sum()/df.shape[0]) * 100
    percentage.append({"Variable":i,"Percentage":per})

per_null = pd.DataFrame(percentage)
print(per_null)

               Variable  Percentage
0                    id    0.000000
1          Unnamed: 0.1    0.000000
2           entity_type    0.000000
3             entity_id    0.000000
4             parent_id  100.000000
5                  name    0.011193
6       normalized_name    0.013228
7             permalink    0.000000
8         category_code   37.326828
9                status    0.000000
10           founded_at   53.586564
11            closed_at   98.667026
12               domain   35.617874
13         homepage_url   35.617874
14     twitter_username   58.997828
15             logo_url   43.979486
16           logo_width   43.979486
17          logo_height   43.979486
18    short_description   96.371971
19          description   53.168865
20             overview   35.401139
21             tag_list   58.559778
22         country_code   55.233448
23           state_code   74.102151
24                 city   57.319400
25               region    0.000000
26  first_investment_at   98.685851
27   last_investment_at   98.685851
28    investment_rounds   98.681780
29   invested_companies   98.681780
30     first_funding_at   83.970227
31      last_funding_at   83.970227
32       funding_rounds   83.868473
33    funding_total_usd   85.818583
34   first_milestone_at   53.346426
35    last_milestone_at   53.346426
36           milestones   53.346426
37        relationships   34.029498
38           created_by   20.869689
39           created_at    0.000000
40           updated_at    0.000000
41                  lat   57.338733
42                  lng   57.338733
43                  ROI   99.630634

* Add threshold to handling null values
* if 0-20% missing values then we drop that
* if 20-60% missing values then we handle this using mean, median and mode
* if more than 60% missing values then drop that column

In [234]:
# Condition 1: percentage < 20
condition_1 = per_null["Percentage"] < 20
filtered_rows_1 = per_null[condition_1]
print("Percentage < 20:")
print(filtered_rows_1)
print("-"*35)

# Condition 2: 20 <= Percentage < 60
condition_2 = (per_null["Percentage"] >= 20) & (per_null["Percentage"] < 60)
filtered_rows_2 = per_null[condition_2]
print("20 <= Percentage < 60:")
print(filtered_rows_2)
print("-"*35)

# Condition 3: Percentage >= 60
condition_3 = per_null["Percentage"] >= 60
filtered_rows_3 = per_null[condition_3]
print("Percentage >= 60:")
print(filtered_rows_3)

Percentage < 20:
           Variable  Percentage
0                id    0.000000
1      Unnamed: 0.1    0.000000
2       entity_type    0.000000
3         entity_id    0.000000
5              name    0.011193
6   normalized_name    0.013228
7         permalink    0.000000
9            status    0.000000
25           region    0.000000
39       created_at    0.000000
40       updated_at    0.000000
-----------------------------------
20 <= Percentage < 60:
              Variable  Percentage
8        category_code   37.326828
10          founded_at   53.586564
12              domain   35.617874
13        homepage_url   35.617874
14    twitter_username   58.997828
15            logo_url   43.979486
16          logo_width   43.979486
17         logo_height   43.979486
19         description   53.168865
20            overview   35.401139
21            tag_list   58.559778
22        country_code   55.233448
24                city   57.319400
34  first_milestone_at   53.346426
35   last_milestone_at   53.346426
36          milestones   53.346426
37       relationships   34.029498
38          created_by   20.869689
41                 lat   57.338733
42                 lng   57.338733
-----------------------------------
Percentage >= 60:
               Variable  Percentage
4             parent_id  100.000000
11            closed_at   98.667026
18    short_description   96.371971
23           state_code   74.102151
26  first_investment_at   98.685851
27   last_investment_at   98.685851
28    investment_rounds   98.681780
29   invested_companies   98.681780
30     first_funding_at   83.970227
31      last_funding_at   83.970227
32       funding_rounds   83.868473
33    funding_total_usd   85.818583
43                  ROI   99.630634

* Firstly we drop columns having more than 60% null values as well as columns which are unnecessary for analysis. Perhaps columns like 'closed_at',
'invested_companies','funding_rounds','funding_total_usd' are important for analysis, we will kept it eventhough it has so many null values.

In [235]:
# drop columns
df.drop(["id","Unnamed: 0.1","entity_type","entity_id","normalized_name","parent_id","domain","homepage_url","twitter_username","logo_url","logo_width","logo_height",
         "description","overview","tag_list","city","region","first_milestone_at","last_milestone_at","created_by","lat","lng",
         "short_description","state_code","first_investment_at","last_investment_at","investment_rounds",
         "first_funding_at","last_funding_at","ROI"], inplace=True, axis=1)

In [236]:
df.isnull().sum()

name                      22
permalink                  0
category_code          73367
status                     0
founded_at            105326
closed_at             193933
country_code          108563
invested_companies    193962
funding_rounds        164846
funding_total_usd     168679
milestones            104854
relationships          66886
created_at                 0
updated_at                 0
dtype: int64

# Handeling null values

1.name 
* Although 'name' column has 22 null values we can drop that values also, but here we handle that using 'permalink' column.

In [237]:
indices_of_null=np.where(pd.isnull(df["name"]))
for i in indices_of_null:
    company_name=df["permalink"].str.split('/').str[-1].iloc[i]
    #print(company_name)
    df["name"].fillna(company_name[i],inplace=True)
    print(df["name"][i])

9079                           ndice-virtual
12033                            cho-capital
20890                          s-dating-game
29978                  stjysk-innovation-a-s
59623                     lite-diving-agency
65122                              ejn-d-o-o
67052                              etolution
68942                                   oqho
73118                       lborg-industries
78002                   olski-center-velenje
102076                       dition-lingerie
112033    ilek-havuz-sauna-san-ve-tic-ltd-ti
114788                            izim-masas
117156                           resundswebb
124907    nano-technologies-of-conductorsllc
129064                              nas-pies
129094                                    ga
134424                           berresearch
144917                               torrent
160132                               bermind
161352                            gps-optics
175508                                nh-sng
Name: name, dtype: object

In [238]:
# Now we can drop 'permalink' column as we kept it for handeling missing values of 'name' column
df.drop("permalink", inplace=True, axis=1)

2. category_code
* This column lies in our 2nd criterion of null values, so we try to fill missing values

In [240]:
# we replace null values of category_code with mode of column
df["category_code"].fillna(df["category_code"].mode()[0], inplace=True)

3. founded_at
* First we convert it into datetime and then handle the missing values.

In [241]:
# convert into datetime
df["founded_at"]=pd.to_datetime(df["founded_at"])
df["founded_at"]=df["founded_at"].dt.year

# fill missing values
df['founded_at'] = df['founded_at'].fillna(df['founded_at'].mode()[0])
df['founded_at'].value_counts()

2011.0    116542
2012.0     10584
2010.0     10183
2009.0      8948
2008.0      7350
           ...
1901.0         5
1911.0         5
1904.0         4
1913.0         3
1905.0         3
Name: founded_at, Length: 114, dtype: int64

4.closed_at
* First convert it into datetime , then handle missing values
* Here we have too many missing values, so if handle this by mode then it may be give wrong predictions further
* To avoid this we put some conditions like if company status is operating/ipo then we take 2030 as closed year and if status is closed/accquired then we take 2010 as closed year for company

In [242]:
# convert into datetime
df["closed_at"]=pd.to_datetime(df["closed_at"])
df["closed_at"]=df["closed_at"].dt.year
df["closed_at"].unique()

array([  nan, 2010., 2011., 2012., 2013., 2009., 2007., 2008., 2001.,
       2006., 2014., 2003., 2004., 1963., 2002., 2005., 1991., 1998.,
       1986., 1997., 2000.])

In [243]:
# filling null values
for i in df['status']:
    if (i == 'operating' or 'ipo'):
        df['closed_at'].fillna(2030,inplace = True)
    elif (i == 'accquired' or 'closed'):
        df['closed_at'].fillna(2010, inplace = True)

5. country_code
* Eventhough missing values for this column are too many we cant drop entire column, as this column is important for analysis
* so we only drop null values

In [244]:
df.dropna(subset=["country_code"], inplace=True)

6. invested_companies

In [245]:
df['invested_companies'] = df['invested_companies'].fillna(df['invested_companies'].mean())

7. milestones

In [246]:
df['milestones'] = df['milestones'].fillna(df['milestones'].mean())

8. relationships

In [247]:
df['relationships'] = df['relationships'].fillna(df['relationships'].mean())

9. funding_rounds

In [248]:
df['funding_rounds'] = df['funding_rounds'].fillna(df['funding_rounds'].mean())

10. funding_total_usd

In [249]:
df['funding_total_usd'] = df['funding_total_usd'].fillna(df['funding_total_usd'].mean())

In [250]:
df.isnull().sum()

name                  0
category_code         0
status                0
founded_at            0
closed_at             0
country_code          0
invested_companies    0
funding_rounds        0
funding_total_usd     0
milestones            0
relationships         0
created_at            0
updated_at            0
dtype: int64

* Our Data is cleaned properly

In [251]:
# convert created_at, updated_at columns from object to datetime and take only year

df["created_at"]=pd.to_datetime(df["created_at"])
df["created_at"]= df["created_at"].dt.year

df["updated_at"]=pd.to_datetime(df["updated_at"])
df["updated_at"]= df["updated_at"].dt.year

# Handeling duplicated entries

In [252]:
df.duplicated().sum()

4

In [256]:
# remove duplicated values
df.drop_duplicates(inplace=True)

# Feature Engineering

In [258]:
# age of company will give clear idea about span of company so create this column
df["age_of_company"]= df["closed_at"] - df["founded_at"]
print(df[["founded_at","closed_at","age_of_company"]])

print(df["age_of_company"].unique())

        founded_at  closed_at  age_of_company
0           2005.0     2030.0            25.0
1           2011.0     2030.0            19.0
2           2011.0     2030.0            19.0
5           2007.0     2030.0            23.0
6           2008.0     2030.0            22.0
...            ...        ...             ...
196548      2007.0     2030.0            23.0
196549      2007.0     2030.0            23.0
196550      1959.0     2030.0            71.0
196551      2008.0     2030.0            22.0
196552      2007.0     2030.0            23.0

[87986 rows x 3 columns]
[ 25.  19.  23.  22.  27.  24.  21.  18.  20.  26.  47.  29.  28.  44.
  32.   4.   0.  34.  33.  52.  31.   5.  30.   2.   7.  59.  51.   1.
  61.  -2.   3.  43.  39.   6. 100.  50.  46.  49.  35.  48.  63.  82.
  -4.  37.  36.  41.  17.  58.  -3. 109.  -1.   8.  14. 110.  10.  40.
  57.  38. 127.  97.  93.  45.  11.  42.  73.  55.  76.   9.  60.  75.
  54.  56. 124. 129. 104.  72.  71.  78.  74. 123.  77.  13. 111.  68.
 118. 126. 128. 122.  80.  90.  69.  95.  62.  67.  99.  53. 102.  79.
  66.  92.  84.  70.  83.  94. 115.  64.  -8.  87. 103.  98.  88.  65.
  96. 106.  89.  85. 117.  12. 108. 113. 101.  81. 120. 114. 105. -40.
 112.  91. -10. 107. 116.  16.  15. 125. 121.  -6.  -5.  86. 119.  -9.]

In [259]:
# As some values are negative , so to avoid further complecation in analysis we convert negative values to 0
df["age_of_company"]=np.where(df["age_of_company"]<0, 0,df["age_of_company"])   
print(df["age_of_company"].unique())

[ 25.  19.  23.  22.  27.  24.  21.  18.  20.  26.  47.  29.  28.  44.
  32.   4.   0.  34.  33.  52.  31.   5.  30.   2.   7.  59.  51.   1.
  61.   3.  43.  39.   6. 100.  50.  46.  49.  35.  48.  63.  82.  37.
  36.  41.  17.  58. 109.   8.  14. 110.  10.  40.  57.  38. 127.  97.
  93.  45.  11.  42.  73.  55.  76.   9.  60.  75.  54.  56. 124. 129.
 104.  72.  71.  78.  74. 123.  77.  13. 111.  68. 118. 126. 128. 122.
  80.  90.  69.  95.  62.  67.  99.  53. 102.  79.  66.  92.  84.  70.
  83.  94. 115.  64.  87. 103.  98.  88.  65.  96. 106.  89.  85. 117.
  12. 108. 113. 101.  81. 120. 114. 105. 112.  91. 107. 116.  16.  15.
 125. 121.  86. 119.]

# Encoding

In [260]:
df.dtypes

name                   object
category_code          object
status                 object
founded_at            float64
closed_at             float64
country_code           object
invested_companies    float64
funding_rounds        float64
funding_total_usd     float64
milestones            float64
relationships         float64
created_at              int64
updated_at              int64
age_of_company        float64
dtype: object

* Convert categorical column to numeric for building machine learning model

1. name

In [261]:
df["name"].value_counts()

L                           4
Pr                          3
Dell                        2
K                           2
Oliver Exterminating Co.    2
                           ..
mindsquare                  1
Coway USA                   1
Powervation                 1
Health Integrated           1
Closet Couture              1
Name: name, Length: 87971, dtype: int64

* As we can see that 'Name' of company is not in organized form, so we drop name column also, and instead of that consider 'category_code'

In [262]:
df.drop("name", inplace=True, axis=1)

2. category_code

In [263]:
df["category_code"].value_counts()

software            20633
web                  9453
other                7176
ecommerce            5825
mobile               4658
advertising          4378
biotech              4165
games_video          3550
consulting           3502
enterprise           3334
hardware             2207
public_relations     2046
network_hosting      1640
cleantech            1578
education            1517
search               1178
finance               958
health                924
analytics             883
security              880
medical               813
social                798
semiconductor         652
legal                 599
manufacturing         535
travel                441
hospitality           431
news                  385
fashion               381
local                 333
real_estate           315
photo_video           260
music                 259
messaging             252
sports                228
transportation        193
automotive            161
nonprofit             157
design                157
nanotech               68
pets                   47
government             36
Name: category_code, dtype: int64

In [264]:
from sklearn.preprocessing import LabelEncoder

In [265]:
le= LabelEncoder()
df["category_code"]=le.fit_transform(df["category_code"])
df["category_code"].value_counts()

37    20633
41     9453
28     7176
7      5825
22     4658
0      4378
3      4165
12     3550
5      3502
9      3334
14     2207
31     2046
25     1640
4      1578
8      1517
33     1178
11      958
15      924
1       883
34      880
20      813
36      798
35      652
17      599
19      535
40      441
16      431
26      385
10      381
18      333
32      315
30      260
23      259
21      252
38      228
39      193
2       161
27      157
6       157
24       68
29       47
13       36
Name: category_code, dtype: int64

3. country_code
* Here we can see that there are 175 unique values , and it will be very messy if we encoded all of these
* we take first 10 country which are highly counted, and rest kept in one group namely others. After that we encoded the column

In [266]:
unique= df["country_code"].unique()
counts_country=df["country_code"].value_counts()
c= counts_country[0:10]
dataframe_country=c.reset_index()
first10_country=dataframe_country.iloc[:,0]
list_first10_country=first10_country.tolist()
print(list_first10_country)

df["country_code"]= np.where(df["country_code"].isin(list_first10_country), df["country_code"], 'other')
print(df["country_code"].value_counts())

['USA', 'GBR', 'IND', 'CAN', 'DEU', 'FRA', 'AUS', 'ESP', 'IRL', 'ISR']
USA      51636
other    13080
GBR       7372
IND       3924
CAN       3726
DEU       1920
FRA       1652
AUS       1455
ESP       1100
IRL       1079
ISR       1042
Name: country_code, dtype: int64

In [267]:
# Encode
df["country_code"]= le.fit_transform(df["country_code"])
df["country_code"].value_counts()

9     51636
10    13080
5      7372
6      3924
1      3726
2      1920
4      1652
0      1455
3      1100
7      1079
8      1042
Name: country_code, dtype: int64

# data Labelling
* status

In [268]:
df["status"]= df["status"].map({"operating":1,"ipo":1,"acquired":0,"closed":0})
df["status"].value_counts()

1    79226
0     8760
Name: status, dtype: int64

In [269]:
df.dtypes

category_code           int32
status                  int64
founded_at            float64
closed_at             float64
country_code            int32
invested_companies    float64
funding_rounds        float64
funding_total_usd     float64
milestones            float64
relationships         float64
created_at              int64
updated_at              int64
age_of_company        float64
dtype: object

In [270]:
df.head()

,category_code,status,founded_at,closed_at,country_code,invested_companies,funding_rounds,funding_total_usd,milestones,relationships,created_at,updated_at,age_of_company
0,41,1,2005.0,2030.0,9,3.260563,3.000000,3.975000e+07,5.000000,17.000000,2007,2013,25.0
1,12,0,2011.0,2030.0,9,3.260563,1.697345,1.530795e+07,1.387564,6.000000,2007,2008,19.0
2,12,0,2011.0,2030.0,9,3.260563,1.697345,1.530795e+07,4.000000,12.000000,2007,2013,19.0
5,0,1,2007.0,2030.0,10,3.260563,1.697345,1.530795e+07,1.387564,2.000000,2008,2008,23.0
6,4,1,2008.0,2030.0,6,3.260563,1.697345,1.530795e+07,1.387564,4.190062,2008,2010,22.0

* Now all our data is in numeric format